[
 "",
 "",
 "",
 "",
 "Is it possible to have tons of fun while maintaining your competitive spirit? Totally! It is 100% possible. For the geeks who code hard and… Read More",
 "In today’s job market, competition is going so high that only the A++ level resume parse through the ATS and goes right into the recruiter’s… Read More",
 "If you’re a software engineer and loaded with lots of rigid work, little to less work-life balance, and bare minimum pay, it’s understandable to become… Read More",
 "Deloitte USI visited our campus for three roles: Analyst, Business Technology Analyst, and Risk and Financial Advisory. Around 150 students had applied for the role… Read More",
 "I gave this contest on HackerEarth and there were 2 questions that were of medium-hard difficulty. I was able to solve only 1 question after… Read More",
 "I was interviewed at Amazon Bengaluru for SDE 2 role. Round 1 (Online Test, Hackerrank): Doesn’t Remember the questions. But one was easy and the… Read More",
 "Given an array of jumps[] of length N, where each element denotes the maximum length of a jump forward from each index. The task is… Read More",
 "Prerequisite: NP-Completeness, NP Class, Sparse Graph, Independent Set Problem: Given graph G = (V, E) and two integers a and b. A set of a… Read More",
 "Given an array arr[] of length N, The task is to find the maximum and the minimum number in the array. Examples: Input: arr[] =… Read More",
 "Brute Force: It gives a solution to a problem by using the most straightforward method. However, it is typically not a very optimal solution or… Read More",
 "What is a Perfect Binary Tree? A perfect Binary Tree is a binary tree in which each of the internal nodes has exactly two child… Read More",
 "Given N pairs of integers, each integer is between 1 to M, the task is to check if there exist two integers x and y… Read More",
 "A Stack is a temporary memory address space that is used to hold arguments and automatic variables during the invocation of a subprogram or function… Read More",
 "Prefix Notation: Prefix notation is the notation in which operators are placed before the corresponding operands in the expression. Example:  Infix notation: A + B… Read More",
 "Is string a keyword? A string is NOT a keyword. It is one of the names of data types declared in the standard library.  How… Read More",
 "Given two arrays arr1[] and arr2[] of length N each and an integer K, The task is to maximize the number of equal elements at… Read More",
 "In this article, we will see how to submit the form without clicking the submit button, along with understanding the different ways to accomplish this… Read More"
]